The above doesn't seem to work on `Scenario Outline`

 When it assesses the child module inside the child module it fails. When it assess the resource, it passes the tests.

Terraform version: Terraform v0.13.3
Terraform-compliance vesrion terraform-compliance v1.3.9 (reproducible on 1.3.6 too)

  # module.example.module.aws_lambda_function.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + arn                            = (known after apply)
      + description                    = "Example lambda function"
      + filename                       = ".terraform/modules/example.aws_lambda_function/function/.terraform/archive_files/lambda_placeholder_content.zip"
      + function_name                  = "nonprod-uk-pc2-pipelines-example"
      + handler                        = "main.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.7"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "blah"
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Account"     = "nonprod"
          + "Component"   = "aws-lambda"
          + "Environment" = "pc2-pipelines"
          + "Handle"      = ""
          + "Location"    = "uk"
          + "Name"        = "nonprod-uk-pc2-pipelines-example"
          + "Service"     = "example"
          + "Squad"       = "blah"
          + "Tribe"       = "blah"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }
Scenario:

    Scenario Outline: Ensure that specific tags are defined
        Given I have resource that supports tags defined
        When it has tags
        Then it must contain <tag_keys>
        And its value must match the "<tag_value>" regex

    Examples:
      | tag_keys          | tag_value                                                                                       |
      | Name              | .+                                                                                              |
      | Environment       | ^(playground\|sandbox\|dev\|staging\|preprod\|prod\|pc2-pipelines\|pc2-service-pipelines)$      |
      | Component         | .+                                                                                              |
      | Service           | .+                                                                                              |
      | Location          | ^(uk\|global1\|sg\|us\|ca)$  
Failure:

 Scenario Outline: Ensure that specific tags are defined
        Given I have resource that supports tags defined
        When it has tags
        Then it must contain <tag_keys>
        And its value must match the "<tag_value>" regex

    Examples:
        | tag_keys    | tag_value                                                                           |
        | Name        | .+                                                                                  |
                Failure: module.example.module.aws_lambda_function.aws_lambda_function.this (aws_lambda_function) does not have Environment property.
        | Environment | ^(playground|sandbox|dev|staging|preprod|prod|pc2-pipelines|pc2-service-pipelines)$ |
          Failure:
        | Component   | .+                                                                                  |

        | Service     | .+                                                                                  |
        | Location    | ^(uk|global1|sg|us|ca)$     |
```

Even by adding the exclude tag, it still fails for this resource. So far the only workaround I found is to skip the whole scenario but that isn't ideal